# PROFILE CHOICES
JOB_SPHERE_CHOICES = [
    ('Кино', 'Кино'),
    ('Телевидение', 'Телевидение'),
    ('Театр', 'Театр'),
    ('Видеоигры', 'Видеоигры'),
    ('Корпоративное видео', 'Корпоративное видео'),
    ('Реклама', 'Реклама'),
    ('Образование', 'Образование'),
]

EXPERIENCE_CHOICES = [
    ('Более 6 лет', 'Более 6 лет'),
    ('Нет опыта', 'Нет опыта'),
    ('От 3 до 6 лет', 'От 3 до 6 лет'),
    ('От 1 года до 3 лет', 'От 1 года до 3 лет'),
]

SPECIALIZATION_CHOICES = [
    ('Режиссер, сценарист', 'Режиссер, сценарист'),
    ('Руководитель отдела маркетинга и рекламы', 'Руководитель отдела маркетинга и рекламы'),
]

EMPLOYMENT_TYPE_CHOICES = [
    ('Полная занятость', 'Полная занятость'),
    ('Частичная занятость', 'Частичная занятость'),
    ('Проектная работа', 'Проектная работа'),
    ('Стажировка', 'Стажировка'),
    ('Волонтерство', 'Волонтерство'),
]

WORK_SCHEDULE_CHOICES = [
    ('Полный день', 'Полный день'),
    ('Сменный график', 'Сменный график'),
    ('Гибкий график', 'Гибкий график'),
    ('Удаленная работа', 'Удаленная работа'),
    ('Вахтовый метод', 'Вахтовый метод'),
]

SKILLS_CHOICES = [
    ('Грамотная речь', 'Грамотная речь'),
    ('Управление персоналом', 'Управление персоналом'),
    ('Деловое общение', 'Деловое общение'),
    ('Управление проектами', 'Управление проектами'),
    ('Работа с большим объемом информации', 'Работа с большим объемом информации'),
    ('Креативность', 'Креативность'),
    ('Подбор персонала', 'Подбор персонала'),
    ('Ориентация на результат', 'Ориентация на результат'),
    ('Управленческие навыки', 'Управленческие навыки'),
    ('Мотивация персонала', 'Мотивация персонала'),
    ('Руководство коллективом', 'Руководство коллективом'),
]

# POST CHOICES
AGE_LIMITS = [
    ('0+', '0+'),
    ('6+', '6+'),
    ('12+', '12+'),
    ('16+', '16+'),
    ('18+', '18+'),
]

BUDGET = [
    ('-', '-'),
    ('От 100 тыс до 1 млн', 'От 100 тыс до 1 млн'),
    ('От 1 млн до 10 млн', 'От 1 млн до 10 млн'),
    ('От 10 млн до 100 млн', 'От 10 млн до 100 млн'),
    ('Более 100 млн', 'Более 100 млн'),
]

PROJECT_TYPE_CHOICES = [
    ('Интервью', 'Интервью'),
    ('Рецензия', 'Рецензия'),
    ('Съемка', 'Съемка'),
    ('Трейлеры и анонсы новых проектов', 'Трейлеры и анонсы новых проектов'),
    ('Информация о наградах и достижениях режиссера', 'Информация о наградах и достижениях режиссера'),
    ('Фестивали и мероприятия', 'Фестивали и мероприятия'),
    ('Обучающие материалы и уроки', 'Обучающие материалы и уроки'),
    ('Личные истории и интересные факты из жизни', 'Личные истории и интересные факты из жизни'),
    ('Сценарий', 'Сценарий'),
    ('Информация о местах съемок и графиках', 'Информация о местах съемок и графиках'),
    ('Рекламный ролик', 'Рекламный ролик'),
    ('Музыкальный клип', 'Музыкальный клип'),
    ('Короткометражный фильм', 'Короткометражный фильм'),
    ('Полнометражный фильм', 'Полнометражный фильм'),
    ('Телешоу', 'Телешоу'),
    ('Веб-сериал', 'Веб-сериал'),
]

PROJECT_GENRE_CHOICES = [
    ('Семейная Драма', 'Семейная Драма'),
    ('Историческая Драма', 'Историческая Драма'),
    ('Военная Драма', 'Военная Драма'),
    ('Криминальная Драма', 'Криминальная Драма'),
    ('Романтическая Комедия', 'Романтическая Комедия'),
    ('Черная Комедия', 'Черная Комедия'),
    ('Мистика', 'Мистика'),
    ('Слешер', 'Слешер'),
    ('Триллер', 'Триллер'),
    ('Детское', 'Детское'),
    ('Образовательное', 'Образовательное'),
    ('Развлекательное', 'Развлекательное'),
    ('Научная Фантастика', 'Научная Фантастика'),
    ('Фентези', 'Фентези'),
    ('Биографический Документальный Фильм', 'Биографический Документальный Фильм'),
    ('Природоведческий Документальный Фильм', 'Природоведческий Документальный Фильм'),
    ('Исторический Документальный Фильм', 'Исторический Документальный Фильм'),
]

MUSIC_GENRE_CHOICES = [
    ('Поп', 'Поп'),
    ('Рок', 'Рок'),
    ('Джаз', 'Джаз'),
    ('Блюз', 'Блюз'),
    ('Классическая', 'Классическая'),
    ('Электронная', 'Электронная'),
    ('Хип-хоп', 'Хип-хоп'),
    ('Рэп', 'Рэп'),
    ('Кантри', 'Кантри'),
    ('Фолк', 'Фолк'),
    ('R&B (Ритм-энд-блюз)', 'R&B (Ритм-энд-блюз)'),
    ('Регги', 'Регги'),
    ('Панк', 'Панк'),
    ('Металл', 'Металл'),
    ('Соул', 'Соул'),
    ('Фонк', 'Фонк'),
    ('Диско', 'Диско'),
    ('Техно', 'Техно'),
    ('Дабстеп', 'Дабстеп'),
    ('Инди', 'Инди'),
    ('Гранж', 'Гранж'),
    ('Госпел', 'Госпел'),
    ('Латиноамериканская музыка', 'Латиноамериканская музыка'),
    ('Реггетон', 'Реггетон'),
    ('К-поп', 'К-поп'),
]

RHYTHM_CHOICES = [
    ('Быстрый ритм', 'Быстрый ритм'),
    ('Медленный ритм', 'Медленный ритм'),
    ('Переменный ритм', 'Переменный ритм'),
    ('Ритмический монтаж', 'Ритмический монтаж'),
    ('Параллельный монтаж', 'Параллельный монтаж'),
    ('Монтаж врезками', 'Монтаж врезками'),
    ('Лейтмотив', 'Лейтмотив'),
]

STYLE_CHOICES = [
    ('Документальный', 'Документальный'),
    ('Псевдодокументальный', 'Псевдодокументальный'),
    ('Авторский', 'Авторский'),
    ('Экспериментальный', 'Экспериментальный'),
    ('Экспрессионизм', 'Экспрессионизм'),
    ('Сюрреализм', 'Сюрреализм'),
    ('Нуар', 'Нуар'),
    ('Неореализм', 'Неореализм'),
    ('Мюзикл', 'Мюзикл'),
    ('Реализм', 'Реализм'),
    ('Пародийный', 'Пародийный'),
    ('Саркастический', 'Саркастический'),
    ('Трагический Мелодраматический', 'Трагический Мелодраматический'),
]